#include <stdlib.h>
#include <stdio.h>
int main03()
{
	//使用自己的函数库 完成如下题目：

	/*1 给校园扣篮比赛的选手打分：
		去掉一个最高分，去掉一个最低分，剩余数的平均分作为其最终得分。
	*/
	int score[][7]={ {5,6,8,10,9,8,6},
					 {7,10,8,10,9,8,6},
					 {8,6,8,8,9,8,6},
					 {6,6,8,10,9,8,6}}	;


	/*
	 2  一个小学校要对新生进行电脑分班。新生一共90名学生，要求平均分成3个班
	   每个班的座位为5行6列，因此要以升序的方式，按座位打印每个班的学生座位对应的学号
	*/
 
	int students[90];
	int classes[3][30];//1 班  2班  3班

		 
 

	/* 3 .由于2班的班主任是教学组组长，有几个“走后门”要作弊，必须把学生安排在2班
		 这几个学生分别是： 22号  33号  59号。请帮忙完成校长的嘱托。
	*/
 
	return 0;
}