#include<iostream>
#include<Windows.h>
#include"Kernel.h"
using namespace std;

int main() {
	//-------------------
	string s;
	char a[] = "asdfgvbj";
	s = a;
	//-------------------

	Kernel kernel;
	//打开服务端
	if (!kernel.startServer()) {
		cout << "打开网络失败" << endl;
		return 1;
	}
	while (true) {
		cout << "server is running." << endl;
		Sleep(5000);
	}
	return 0;
}

// IM聊天软件(C/S架构)
// 注册
// 登录
// 添加好友
// 聊天
// 下线

// 客户端(QT)
// UI界面
// 核心处理类(kernel,处理收到的数据,准备要发送的数据)
// 中介者类(发送数据,接收数据,打开网络,关闭网络)
// 网络类(发送数据,接收数据,初始化网络,关闭网络)

// 服务端(VS)
// 数据库类(连接数据库,断开连接,查询数据库,修改数据库)
// 核心处理类(kernel,处理收到的数据,准备要发送的数据)
// 中介者类(发送数据,接收数据,打开网络,关闭网络)
// 网络类(发送数据,接收数据,初始化网络,关闭网络)

// 网络类(TCP,UDP) - 多态
// INET父类
// UDP子类
// TCPServer子类
// TCPClient子类

// 变量类型
// 全局变量:跨文件,跨类使用
// 成员变量:一个类内部使用
// 局部变量:一个大括号内部使用

// 报错类型
// 已有主体：函数重复实现
// 无法解析的外部符号：函数没实现1.库函数未实现,没有导入依赖库;2.自己的函数未实现
// 未定义标识符：函数或者是变量不认识,函数不认识是没加头文件;变量不认识可能是变量未定义
// 库函数的变量或者函数重复定义：头文件重复包含
// 无法实例化抽象类：父类的纯虚函数在子类中没有实现,检查子类的函数是否是纯虚函数

// 两个类之间传递数据
// 1.在一个类中调用另位一个类的函数,通过参数传递数据
// 2.使用qt的信号和槽机制传递数据,可以用来传递数据或事件通知


// AB两个类相互new对象
// 1.第三方已经new过A类对象了,只需要让B类中的A类指针指向这个对象就行,不需要再new新的A类对象
// 2.定义静态成员指针,指向a类的指针,在b类中就可以使用这个静态成员指针调用a类的函数

// QT的信号和槽机制的实现(两个类之间)
// 1.两个类必须直接或间接继承自QObject,有Q_OBJECT宏
// 2.在发送数据的类头文件中使用signals声明信号(信号不是函数,不用实现)
//   信号返回值是void,一般以 "signals_功能名" 命名,在cpp发送的地方使用Q_EMIT或emit 发送信号
// 3.在接收数据数据类的头文件中,使用slots声明槽函数,在cpp中实现槽函数
//   参数和返回值要和信号一致,一般以"slot_功能名"命名
// 4.连接信号和槽函数,在接收数据的类中,发送信号的对象new出来以后
 
// QT使用的是UTF-8
// 转码统一在客户端转,需要转化的字符串满足两个条件:1.字符串可能涉及到中文:
// QString存储UTF_8编码方式的字符串,char*存储GB2312编码方式的字符串
// char*,std::string,QString
// char*是基础类型,std::string,QString都是封装的类,基础类型可以给对象赋值
// std::string转换成char*对象:对象.c_str()
// QString转换成char*:对象.toStdString()

