#include <stdio.h>
//const int a = 8848;
int main11()
{
	/*const作用：修饰一个变量使之变成常量 

	 要求：必须初始化 

	 const 修饰指针变量：
	1：指针变量不可指向新地址
	2：指针变量指向的地址数据不可修改
	*/
    //const int a = 8848;
	//a = 8849;
	//a++;
	/*int* p = &a;
	*p = 8849;
	printf("%d ", a);*/

	//------指向可改 内容不可改------------//

	//int n = 3;
	//int m = 6;
	//const int* p = &n;//p指针变量
	//*p = 8;
	//p = &m;
	

	//----------指向不可改 内容可改---------------//

	//int n = 3;
	//int m = 6;
	//int const * p = &n;//p指针变量
	//*p = 8;
	//p = &m;
	
	
	//----------指向不可改 内容不可改---------------//

	//int n = 3;
	//int m = 6;
	//const int const * p = &n;//p指针变量
	//*p = 8;
	//p = &m;
	
	
	//--结论：const放到谁的前面，谁就不可改---------------//


	return 0;
}