#include<stdio.h>
//②定义一维数组指针（即行指针）pl ，可以指向 具有4个int的行。
//让pl指向arr数组的第0面第0行。
//使用pl结合下标方式对arr数组遍历

int mainzy2() {
    int arr[2][3][4] = { {{1,2,3,4},{1,2,3,4},{1,2,3,4}},{{1,2,3,4},{1,2,3,4},{1,2,3,4}} };
    int(*pl)[4] = &arr[0][0]; // 指向第0面第0行
    for (int k = 0; k < 2; k++) { // 遍历面
        printf("-----第%d面.-----\n", k);
        for (int i = 0; i < 3; i++) { // 遍历行
            for (int j = 0; j < 4; j++) { // 遍历列
                printf("%d ", pl[i][j]); // 等价于 arr[k][i][j]
            }
            printf("\n");
        }
        pl += 3; // 切换到下一面的首行（每面3行）
    }
    return 0;
}