#include<stdio.h>
int main14()
{
	/*
	运算表达式的基本概念：
	1：运算符
	2：操作数
	3：表达式
	4：结合性 
	5：优先级
	*/
	/*
	牢记：只要是表达式 就有一个计算结果
	*/


	/*
	逻辑非 
	not ! 逻辑与 and  &&  逻辑或or ||
	*/

	/*
	&& || 的短路问题
	*/
	/*
逻辑非(相反逻辑) not  ! 逻辑与and 并且  &&  逻辑或or || 或者
*/
	//printf("相反数：%d\n", - - - -8);
	//printf("相反逻辑：%d\n", !!!!8);
	////逻辑与： 全真则真  有假就假
	//printf("%d\n", 5 && 8);
	//printf("%d\n", 0 && 8);
	//printf("%d\n", 5 && 0);
	//printf("%d\n", 0 && 0);
	////逻辑或： 全假则假  有真就真
	//printf(" %d\n", 5 || 8);
	//printf(" %d\n", 0 || 8);
	//printf(" %d\n", 5 || 0);
	//printf(" %d\n", 0 || 0);

	int m = 10, n = 10;
	printf("%d\n", m++ > 10 && --n < 10);
	printf("m=%d n=%d\n", m, n);
	return 0;
}